# Задание №2
# Ильин Ярослав 1993
# Вариант 2

x1 = [6, 7, 4, 9]
x2 = [0, 2, 3, 7, 8, 9, 10]
x3 = x1 + x2
print(x3)

x3.remove(int(input('Введите число для исключения из множества: ')))
print(x3)